# Computing Mean, Median and Mode using Pandas

In [1]:
import pandas as pd
import numpy as np

Data of a population written in a dictionary

In [2]:
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack', 
   'Lee','Chanchal','Gasper','Naviya','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46])}

* create a DataFrame

In [3]:
df = pd.DataFrame(d)
df

        Name  Age
0        Tom   25
1      James   26
2      Ricky   25
3        Vin   23
4      Steve   30
5      Smith   29
6       Jack   23
7        Lee   34
8   Chanchal   40
9     Gasper   30
10    Naviya   51
11    Andres   46

Mean Values in the Distribution

In [4]:
df.mean()

Age    31.833333
dtype: float64

Median Values in the Distribution

In [5]:
df.median()

Age    29.5
dtype: float64

Calculating the mode

In [17]:
df.mode()

        Name   Age
0     Andres  23.0
1   Chanchal  25.0
2     Gasper  30.0
3       Jack   NaN
4      James   NaN
5        Lee   NaN
6     Naviya   NaN
7      Ricky   NaN
8      Smith   NaN
9      Steve   NaN
10       Tom   NaN
11       Vin   NaN

## Pandas mode function

In [4]:
df2 = pd.DataFrame([['bird', 2, 2],
                    ['mammal', 4, np.nan],
                    ['arthropod', 8, 0],
                    ['bird', 2, np.nan]],
                   index=('falcon', 'horse', 'spider', 'ostrich'),
                   columns=('species', 'legs', 'wings'))
df2

           species  legs  wings
falcon        bird     2    2.0
horse       mammal     4    NaN
spider   arthropod     8    0.0
ostrich       bird     2    NaN

In [8]:
df2.mode()   # By default, missing values are not considered

  species  legs  wings
0    bird   2.0    0.0
1     NaN   NaN    2.0

dropna=False NaN values are considered

In [14]:
df2.mode(numeric_only=True)

   legs  wings
0   2.0    0.0
1   NaN    2.0

let mode compute over columns and not rows:

In [13]:
df2.mode(axis='columns', numeric_only=True)

           0    1
falcon   2.0  NaN
horse    4.0  NaN
spider   0.0  8.0
ostrich  2.0  NaN